## 21.06.02 서현진 한경아카데미

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

# 1. Titanic - sns.load_dataset('titanic')

a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

    1)20살이 넘으면 성별을 그대로 사용한다.

    2)20살 미만이면 성별에 관계없이 “child”라고 한다.

​
b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

​
d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

    bins = [1, 20, 30, 50, 70, 100]

    labels = ["미성년자", "청년", "중년", "장년", "노년"]

​
e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [2]:
titanic = sns.load_dataset("titanic")
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
# a)
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age >= 20 else 'child', axis =1)
titanic.tail() # 확인

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [4]:
# b)
titanic['age'] = titanic['age'].fillna(titanic['age'].mean()).astype(int)
titanic.tail() # 확인

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [5]:
# c)
# 성별 생존율
group_sex_alive = titanic.sex.groupby([titanic.sex, titanic.alive]).count()
group_sex_alive

sex     alive
female  no        81
        yes      233
male    no       468
        yes      109
Name: sex, dtype: int64

In [6]:
# 여성 생존율
# group_sex_alive.female.yes == 233 / len( titanic[titanic.sex == 'female']) == 314
print(f'여성의 생존율은 { round( group_sex_alive.female.yes / len( titanic[titanic.sex == "female"]) , 3) }입니다.')

여성의 생존율은 0.742입니다.

In [7]:
# 남성 생존율
# group_sex_alive.male.yes  == 109  /  len( titanic[titanic.sex == 'male']) == 577
print(f'남성의 생존율은 { round(group_sex_alive.male.yes / len( titanic[titanic.sex == "male"]), 3) }입니다.')

남성의 생존율은 0.189입니다.

In [8]:
# c)
#선실(class)별 생존율
group_class_alive = titanic.pclass.groupby([titanic.pclass, titanic.alive]).count()
group_class_alive

pclass  alive
1       no        80
        yes      136
2       no        97
        yes       87
3       no       372
        yes      119
Name: pclass, dtype: int64

In [9]:
#선실(class)별 생존율
for i in range(1,4): #1,2,3 선실 
    group_class_alive_ratio  = group_class_alive[i].yes / len( titanic[titanic.pclass == i])
    print(f'{i}선실의 생존율은 {round(group_class_alive_ratio,3)}입니다.')

1선실의 생존율은 0.63입니다.
2선실의 생존율은 0.473입니다.
3선실의 생존율은 0.242입니다.

In [10]:
# c)
# 출발지(embark_town)별 생존율
group_embark_town_alive = titanic.embark_town.groupby([titanic.embark_town, titanic.alive]).count()
group_embark_town_alive

embark_town  alive
Cherbourg    no        75
             yes       93
Queenstown   no        47
             yes       30
Southampton  no       427
             yes      217
Name: embark_town, dtype: int64

In [11]:
# 출발지(embark_town)별 생존율
# Cherbourg
print(f'Cherbourg의 생존율은 { round( group_embark_town_alive.Cherbourg.yes / len( titanic[titanic.embark_town == "Cherbourg"] ) , 3) }입니다.')

Cherbourg의 생존율은 0.554입니다.

In [12]:
#Queenstown
print(f'Queenstown의 생존율은 { round( group_embark_town_alive.Queenstown.yes / len( titanic[titanic.embark_town == "Queenstown"] ) , 3) }입니다.')

Queenstown의 생존율은 0.39입니다.

In [13]:
# Southampton
print(f'Southampton의 생존율은 { round( group_embark_town_alive.Queenstown.yes / len( titanic[titanic.embark_town == "Southampton"] ) , 3) }입니다.')

Southampton의 생존율은 0.047입니다.

In [14]:
# d)​타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age, bins, labels=labels)
cats.value_counts()

청년      408
중년      239
미성년자    166
장년       60
노년        4
Name: age, dtype: int64

In [15]:
titanic['age_group'] = pd.cut(titanic.age.values, bins, labels=labels)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_group
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [16]:
# 나이그룹(age_group)별 생존율
age_group_alive = titanic.age_group.groupby([titanic.age_group, titanic.alive]).count()
age_group_alive

age_group  alive
미성년자       no        96
           yes       70
청년         no       272
           yes      136
중년         no       137
           yes      102
장년         no        39
           yes       21
노년         no         3
           yes        1
Name: age_group, dtype: int64

In [17]:
# alive_yes value
for i in range(5):  
    print(age_group_alive[i*2 + 1])

70
136
102
21
1

In [18]:
# 나이그룹(age_group)별 생존율
labels = ["미성년자", "청년", "중년", "장년", "노년"]
for i in range(5) : # 5카테고리이므로
    print(f'{labels[i]}의 생존율은 { round( age_group_alive[i*2+1] / len( titanic[titanic.age_group == labels[i] ] ) , 3) }입니다.')

미성년자의 생존율은 0.422입니다.
청년의 생존율은 0.333입니다.
중년의 생존율은 0.427입니다.
장년의 생존율은 0.35입니다.
노년의 생존율은 0.25입니다.

In [19]:
#e) qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

labels2 = ["g1", "g2", 'g3']
cats2 = pd.qcut(titanic['age'], 3, labels=labels2)
cats2.value_counts()

g2    304
g1    301
g3    286
Name: age, dtype: int64

In [20]:
titanic['age_group2'] = pd.qcut(titanic['age'], 3, labels=labels2)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_group,age_group2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년,g2
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자,g1
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년,g2
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년,g2
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,g3

In [21]:
# 나이 그룹2별 남녀 성비
age_group2_sex = titanic.age_group2.groupby([titanic.age_group2, titanic.sex]).count()
age_group2_sex

age_group2  sex
g1          female    122
            male      179
g2          female     97
            male      207
g3          female     95
            male      191
Name: age_group2, dtype: int64

In [22]:
# 나이 그룹2별 남녀 성비
# labels2 = ["g1", "g2", 'g3']
for i in range(3) : # 3카테고리이므로
    print(f'{labels2[i]}의 남성의 비율은 { round( age_group2_sex[i*2+1] / len( titanic[titanic.age_group2 == labels2[i] ] ) , 2)} 이며, 여성의 비율은 { round( age_group2_sex[i*2] / len( titanic[titanic.age_group2 == labels2[i] ] ) , 2)} 입니다.')

g1의 남성의 비율은 0.59 이며, 여성의 비율은 0.41 입니다.
g2의 남성의 비율은 0.68 이며, 여성의 비율은 0.32 입니다.
g3의 남성의 비율은 0.67 이며, 여성의 비율은 0.33 입니다.

In [23]:
# 나이 그룹2별 생존율
age_group2_alive = titanic.age_group2.groupby([titanic.age_group2, titanic.alive]).count()
age_group2_alive

age_group2  alive
g1          no       177
            yes      124
g2          no       202
            yes      102
g3          no       170
            yes      116
Name: age_group2, dtype: int64

In [24]:
#age_group2_alive_yes
for i in range(3) :
    print(age_group2_alive[i*2+1] )

124
102
116

In [25]:
# 나이 그룹2별 생존율
# labels2 = ["g1", "g2", 'g3']
for i in range(3) : # 3카테고리이므로
    print(f'{labels2[i]}의 생존율은 { round( age_group2_alive[i*2+1] / len( titanic[titanic.age_group2 == labels2[i] ] ) , 2)} 입니다.')

g1의 생존율은 0.41 입니다.
g2의 생존율은 0.34 입니다.
g3의 생존율은 0.41 입니다.

# 2. Mile Per Gallon - sns.load_dataset('mpg')

a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

b.name으로부터 manufacturer(제조사)와 모델을 추출하여  새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

e.모델이 5개 이상인 제조사에 대하여  연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [3]:
mpg_dataset = sns.load_dataset('mpg')
mpg_dataset.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [4]:
#a)
mpg_dataset["hp_per_cc"] =  mpg_dataset['horsepower'] / mpg_dataset['displacement']
mpg_dataset.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

In [5]:
#b) 
# name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가
mpg_dataset['manufacturer'] = mpg_dataset.name.str.split(' ').str[0]
mpg_dataset.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698,plymouth
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421,amc
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576,ford

In [7]:
mpg_dataset['model'] = mpg_dataset.name.str.split(' ',1).str[1] #name에서 제조사뒤의 명칭이 모두 모델명이므로
mpg_dataset.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576,ford,torino

In [8]:
#name 열은 삭제
mpg_dataset.drop(['name'],axis=1, inplace= True)
mpg_dataset.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

In [9]:
#c)
#엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균
mpg_dataset.groupby(mpg_dataset.cylinders).mean()['mpg']

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [10]:
#d)
# 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균
mpg_dataset.groupby(mpg_dataset.origin).mean()['hp_per_cc']

origin
europe    0.740005
japan     0.789485
usa       0.512063
Name: hp_per_cc, dtype: float64

In [33]:
#e)
# 모델이 5개 이상인 제조사시리즈
model_count_over5 = mpg_dataset.groupby(mpg_dataset.manufacturer).count()['model'] >= 5
model_count_over5.name = 'model_count_over5'
model_count_over5

manufacturer
amc               True
audi              True
bmw              False
buick             True
cadillac         False
capri            False
chevroelt        False
chevrolet         True
chevy            False
chrysler          True
datsun            True
dodge             True
fiat              True
ford              True
hi               False
honda             True
maxda            False
mazda             True
mercedes         False
mercedes-benz    False
mercury           True
nissan           False
oldsmobile        True
opel             False
peugeot           True
plymouth          True
pontiac           True
renault           True
saab             False
subaru           False
toyota            True
toyouta          False
triumph          False
vokswagen        False
volkswagen        True
volvo             True
vw                True
Name: model_count_over5, dtype: bool

In [34]:
# 모델이 5개 이상인 제조사의 mpg 데이터를 가져오기 위하여 데이터 병합
mpg_mergeset = pd.merge(mpg_dataset, model_count_over5, on='manufacturer' )
mpg_mergeset.head() # 확인

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model,model_count_over5
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu,True
1,14.0,8,454.0,220.0,4354,9.0,70,usa,0.484581,chevrolet,impala,True
2,15.0,8,400.0,150.0,3761,9.5,70,usa,0.375000,chevrolet,monte carlo,True
3,28.0,4,140.0,90.0,2264,15.5,71,usa,0.642857,chevrolet,vega 2300,True
4,17.0,6,250.0,100.0,3329,15.5,71,usa,0.400000,chevrolet,chevelle malibu,True

In [35]:
#모델이 5개 이상인 제조사의 mpg 평균, 상위5개
mpg_mergeset[mpg_mergeset['model_count_over5']==True].groupby(mpg_mergeset.manufacturer).mean()['mpg'].sort_values(ascending=False).head(5)

manufacturer
vw         39.016667
honda      33.761538
renault    32.880000
datsun     31.113043
mazda      30.860000
Name: mpg, dtype: float64